RyanHailey21/esp32_drone/Mission.cpp
        // ── HOVER TEST ───────────────────────────────────────
        case HOVER_TEST:
            channels[CH_ARM]   = 1800;
            channels[CH_ANGLE] = angleModeChannelValue();
            // Ramp toward HOVER_THROTTLE at ~200 µs/s so a rapid step from the
            // ARMING low-throttle doesn't trigger Betaflight's ANTI_GRAVITY I-term boost.
            if (channels[CH_THROTTLE] < (uint16_t)HOVER_THROTTLE) {
                channels[CH_THROTTLE] = min((uint16_t)(channels[CH_THROTTLE] + HOVER_RAMP_STEP_US),
                                            (uint16_t)HOVER_THROTTLE);
            } else {
                channels[CH_THROTTLE] = HOVER_THROTTLE;
            }
            sendRC();
            digitalWrite(STATUS_LED, millis() % 500 < 250);

#if SERIAL_FLIGHT_DEBUG
            Serial.printf("[HOVER] throttle=%d  target=%d  angleAux=%d\n",
                channels[CH_THROTTLE], (int)HOVER_THROTTLE, channels[CH_ANGLE]);
#endif
            break;

        // ── AUTO HOVER CAL ───────────────────────────────────
        case AUTO_HOVER_CAL:
            channels[CH_ARM]      = 1800;
            channels[CH_ANGLE]    = angleModeChannelValue();
            channels[CH_THROTTLE] = calThrottle;
            sendRC();
            digitalWrite(STATUS_LED, millis() % 300 < 150);

            if (millis() - calStepTime >= CAL_STEP_MS) {
                calStepTime = millis();
                if (calThrottle < CAL_MAX_THROTTLE) calThrottle += CAL_STEP_US;
            }

#if SERIAL_FLIGHT_DEBUG
            Serial.printf("[AUTO_HOVER] alt=%.2fm  throttle=%d\n", altitude, calThrottle);
#endif

            if (altitude >= CAL_LIFTOFF_M) calLiftoffCount++;
            else                            calLiftoffCount = 0;

            if (calLiftoffCount >= 5) {
                HOVER_THROTTLE = constrain(calThrottle + CAL_GE_OFFSET_US, 1200, 1600);
                if (hoverChar) hoverChar->setValue((uint8_t*)&HOVER_THROTTLE, 2);
                channels[CH_THROTTLE] = HOVER_THROTTLE;
                sendRC();
                state = HOVER_TEST;
#if SERIAL_FLIGHT_DEBUG
                Serial.printf("[AUTO_HOVER] liftoff confirmed (%d counts), HOVER_THROTTLE=%d -> HOVER TEST\n",
                    calLiftoffCount, HOVER_THROTTLE);
#endif
                break;
            }

            if (calThrottle >= CAL_MAX_THROTTLE || millis() - calTime >= CAL_TIMEOUT_MS) {
                disarmToIdle("[AUTO_HOVER] Calibration failed -> IDLE");
            }
            break;

        // ── ALT HOLD ─────────────────────────────────────────
        case ALT_HOLD: {
            channels[CH_ARM]   = 1800;
            channels[CH_ANGLE] = angleModeChannelValue();

            uint16_t thr;
            uint32_t timeInAltHold = millis() - (armTime + ARMING_MS);
            updateAltHoldTofBaseline();
            float lowRel = lowAltitudeRelM(altitude);
            float controlAlt = lastTofValid && lastTofWeightPct >= 80 ? lowRel : altitude;
            if (timeInAltHold < BARO_SETTLE_MS) {
                altHoldGuardPhase = 0;
                launchAlt = rawAlt;
                if (lastTofValid) {
                    altHoldTofBaselineValid = true;
                    altHoldTofBaselineM = lastTofAltM;
                }
                altHoldCascadeLatched = false;
                altHoldLiftoffCount = 0;
                thr = takeoffGuardThrottle(timeInAltHold, lastTofValid);
                resetCascadeController(0.0f);
                if (timeInAltHold % 100 < 20) {
#if SERIAL_FLIGHT_DEBUG
                    Serial.printf("[ALT_HOLD] settle  t=%ums rawAlt=%.2f launchAlt=%.2f rel=%.2f tofRel=%.2f tofW=%u\n",
                        timeInAltHold, rawAlt, launchAlt, altitude, lowRel, lastTofWeightPct);
#endif
                }
            } else if (!altHoldCascadeLatched) {
                altHoldGuardPhase = 1;
                bool tofConfirmed = lastTofValid && lastTofWeightPct >= 80 && lowRel >= TAKEOFF_ALT_M;
                if (tofConfirmed) {
                    if (altHoldLiftoffCount < 255) altHoldLiftoffCount++;
                } else {
                    altHoldLiftoffCount = 0;
                }

                if (altHoldLiftoffCount >= TAKEOFF_CONFIRM_SAMPLES) {
                    altHoldCascadeLatched = true;
                    altHoldGuardPhase = 2;
                    resetCascadeController(controlAlt);
                    thr = holdCascaded(controlAlt, false);
#if SERIAL_FLIGHT_DEBUG
                    Serial.printf("[ALT_HOLD] ToF liftoff latched rel=%.2f tofRel=%.2f tof=%.2f count=%u\n",
                        altitude, lowRel, lastTofAltM, altHoldLiftoffCount);
#endif
                } else if (timeInAltHold < GROUND_GUARD_TIMEOUT_MS) {
                    thr = takeoffGuardThrottle(timeInAltHold, lastTofValid);
                    resetCascadeController(controlAlt);
                    if (timeInAltHold % 100 < 20) {
#if SERIAL_FLIGHT_DEBUG
                        Serial.printf("[ALT_HOLD] guard   t=%ums rawAlt=%.2f launchAlt=%.2f rel=%.2f tofRel=%.2f tofW=%u count=%u thr=%u\n",
                            timeInAltHold, rawAlt, launchAlt, altitude, lowRel, lastTofWeightPct, altHoldLiftoffCount, thr);
#endif
                    }
                } else {
                    thr = HOVER_THROTTLE;
                    channels[CH_THROTTLE] = thr;
                    sendRC();
#if SERIAL_FLIGHT_DEBUG
                    Serial.printf("[ALT_HOLD] ground guard expired without ToF liftoff confirmation, landing rel=%.2f tofRel=%.2f tofW=%u\n",
                        altitude, lowRel, lastTofWeightPct);
#endif
                    startLanding(controlAlt);
                    break;
                }
            } else {
                altHoldGuardPhase = 2;
                thr = holdCascaded(controlAlt, false);
            }
            if (altHoldGuardPhase != 2) {
                lastAltError = 0.0f;
                lastDesiredVspeed = 0.0f;
                lastVspeedError = 0.0f;
                lastControlPUs = 0.0f;
                lastControlIUs = 0.0f;
                lastRawThrottle = thr;
                lastThrMin = thr;
                lastThrMax = thr;
                lastClampedThrottle = thr;
                lastThrottleSat = 0;
            }
            channels[CH_THROTTLE] = thr;
            sendRC();
            logFlightSample(timeInAltHold, altHoldGuardPhase == 0 ? "settle" : (altHoldGuardPhase == 1 ? "guard" : "cascade"),
                controlAlt, lowRel, thr);
            digitalWrite(STATUS_LED, millis() % 500 < 250);

            // Tight safety ceiling: if baro or controller misbehaves, land before getting dangerous.
            float holdTarget  = constrain((float)ALT_HOLD_TARGET_M, ALT_HOLD_TARGET_MIN_M, ALT_HOLD_TARGET_MAX_M);
            float safeCeiling = holdTarget + 2.0f;
            if (controlAlt > safeCeiling) {
#if SERIAL_FLIGHT_DEBUG
                Serial.printf("[ALT_HOLD] safety ceiling %.1fm exceeded at %.2fm, landing\n", safeCeiling, controlAlt);
#endif
                startLanding(controlAlt);
            }
            break;
        }

