RyanHailey21/esp32_drone/Mission.cpp
        // ── LANDING ──────────────────────────────────────────
        case LANDING: {
            channels[CH_ARM]   = 1800;
            channels[CH_ANGLE] = angleModeChannelValue();
            digitalWrite(STATUS_LED, millis() % 200 < 30);

            // ToF can detect ground immediately. Baro/fused fallback must first
            // show real descent so a stale zero cannot kill motors mid-air.
            float lowRel = lowAltitudeRelM(altitude);
            float landingAlt = lastTofValid && lastTofWeightPct >= 80 ? lowRel : altitude;
            bool hasDescended = (landingStartAlt - landingAlt) > 0.3f;
            bool tofGround = lastTofValid && lastTofWeightPct >= 80 && lowRel <= LANDING_GROUND_M;
            bool fallbackGround = !tofGround && hasDescended && landingAlt <= LANDING_GROUND_M;
            bool startedOnGround = landingStartAlt <= LANDING_GROUND_M && landingAlt <= LANDING_GROUND_M;
            if (tofGround || fallbackGround || startedOnGround) {
                disarmToIdle("[LANDING] ground detected");
                break;
            }
            if (millis() - landingStartMs >= LANDING_TIMEOUT_MS) {
                disarmToIdle("[LANDING] timeout");
                break;
            }

            float rateError           = (-DESCENT_RATE_MPS) - filteredVario;
            int16_t correction        = (int16_t)(LANDING_KP_VSPEED * rateError);
            float landingBaseThrottle = max((float)MIN_ALT_HOLD_THROTTLE_US,
                                            (float)HOVER_THROTTLE - LANDING_THROTTLE_OFFSET_US);
            float landingRawThrottle  = landingBaseThrottle + correction;
            float landingMinThrottle  = max(1000.0f, (float)HOVER_THROTTLE - THR_DOWN_OFFSET_US);
            float landingMaxThrottle  = (float)HOVER_THROTTLE + 50.0f;
            channels[CH_THROTTLE]     = (uint16_t)constrain(landingRawThrottle, landingMinThrottle, landingMaxThrottle);
            lastAltError = 0.0f;
            lastDesiredVspeed = -DESCENT_RATE_MPS;
            lastVspeedError = rateError;
            lastControlPUs = correction;
            lastControlIUs = 0.0f;
            lastRawThrottle = landingRawThrottle;
            lastThrMin = landingMinThrottle;
            lastThrMax = landingMaxThrottle;
            lastClampedThrottle = channels[CH_THROTTLE];
            lastThrottleSat = landingRawThrottle > landingMaxThrottle ? 1 : (landingRawThrottle < landingMinThrottle ? -1 : 0);
            sendRC();
            logFlightSample(millis() - landingStartMs, "landing", landingAlt, lowRel, channels[CH_THROTTLE]);

#if SERIAL_FLIGHT_DEBUG
            Serial.printf("[LANDING] alt=%.2fm  tofRel=%.2f  filtV=%.2f  thr=%d\n",
                landingAlt, lowRel, filteredVario, channels[CH_THROTTLE]);
#endif
            break;
        }

        case DONE:
            sendRC();
            digitalWrite(STATUS_LED, millis() % 100 < 50);
            break;
    }
}
